отаман_головний() {
    вперед_козаки;

    велика_дробова температура;
    сказати << "Введіть температуру на дворі: ";
    слухати >> температура;

    якщо (температура < нуль) {
        сказати << "Холодно, як у бусурмана на душі! Одягай кожух!" << курінь_новий;
    } анумо якщо (температура >= нуль && температура < 20) {
        сказати << "Тепленько, як у козака після доброго кухоля!" << курінь_новий;
    } анумо {
        сказати << "Спекотно, як у шаблі після бою! Іди в тінь!" << курінь_новий;
    }

    повернути нуль;
}
